{
  "derechos": [
    "Lea detenidamente y de forma comprensible, repitiendo si es necesario, los derechos que le asisten.",
    "a) Derecho a guardar silencio no declarando si no quiere, a no contestar alguna o algunas de las preguntas que le formulen, o a manifestar que sólo declarará ante el juez.",
    "b) Derecho a no declarar contra sí mismo y a no confesarse culpable.",
    "c) Derecho a designar abogado, sin perjuicio de lo dispuesto en el apartado 1.a) del artículo 527 y a ser asistido por él sin demora injustificada. En caso de que, debido a la lejanía geográfica no sea posible de inmediato la asistencia de letrado, se facilitará al detenido comunicación telefónica o por videoconferencia con aquél, salvo que dicha comunicación sea imposible.",
    "e) Derecho a que se ponga en conocimiento del familiar o persona que desee, sin demora injustificada, su privación de libertad y el lugar de custodia en que se halle en cada momento. Los extranjeros tendrán derecho a que las circunstancias anteriores se comuniquen a la oficina consular de su país.",
    "f) Derecho a comunicarse telefónicamente, sin demora injustificada, con un tercero de su elección. Esta comunicación se celebrará en presencia de un funcionario de policía o, en su caso, del funcionario que designen el juez o el fiscal, sin perjuicio de lo dispuesto en el artículo 527.\n(DERECHO NO APLICABLE SI ES INVESTIGADO)",
    "g) Derecho a ser visitado por las autoridades consulares de su país, a comunicarse y a mantener correspondencia con ellas.\n(DERECHO NO APLICABLE SI ES INVESTIGADO)",
    "h) Derecho a ser asistido gratuitamente por un intérprete, cuando se trate de extranjero que no comprenda o no hable el castellano o la lengua oficial de la actuación de que se trate, o de personas sordas o con discapacidad auditiva, así como de otras personas con dificultades del lenguaje.",
    "i) Derecho a ser reconocido por el médico forense o su sustituto legal y, en su defecto, por el de la institución en que se encuentre, o por cualquier otro dependiente del Estado o de otras Administraciones Públicas.\n(DERECHO NO APLICABLE SI ES INVESTIGADO)",
    "j) Derecho a solicitar asistencia jurídica gratuita, procedimiento para hacerlo y condiciones para obtenerla."
  ]
}